cases/subsonic/Lambert/J10_Ligament/setup/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// nut = Cmu * k / omega = 0.09 * 47.0 / 4140 = 1.02e-3 m^2/s
//

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.02e-3;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.02e-3;
    }

    outletRight
    {
        type            calculated;
        value           uniform 1.02e-3;
    }

    wallTop
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    wallBottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    front
    {
        type            symmetry;
    }

    back
    {
        type            symmetry;
    }
}

// ************************************************************************* //
