cases/subsonic/Lambert/J10_Ligament/setup/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Lambert (ILASS 2019): p = 506625 Pa = 5 atm, T = 300 K
// Inlet: zeroGradient (velocità imposta → p si adatta)
// Outlets: totalPressure per replicare pressure-outlet di Fluent
//

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 506625;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outletRight
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 506625;
        value           uniform 506625;
    }

    wallTop
    {
        type            fixedFluxPressure;
        value           uniform 506625;
    }

    wallBottom
    {
        type            fixedFluxPressure;
        value           uniform 506625;
    }

    front
    {
        type            symmetry;
    }

    back
    {
        type            symmetry;
    }
}

// ************************************************************************* //
